JaeheeKwon/nuttx/arch/arm/src/stm32h5/hardware/stm32h5x3xx_uart.h
#if STM32H5_NUART > 0
#  define STM32_UART4_CR1        (STM32_UART4_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART4_CR2        (STM32_UART4_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART4_CR3        (STM32_UART4_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART4_BRR        (STM32_UART4_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART4_GTPR       (STM32_UART4_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART4_RTOR       (STM32_UART4_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART4_RQR        (STM32_UART4_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART4_GTPR       (STM32_UART4_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART4_ISR        (STM32_UART4_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART4_ICR        (STM32_UART4_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART4_RDR        (STM32_UART4_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART4_TDR        (STM32_UART4_BASE + STM32_USART_TDR_OFFSET)
#endif

#if STM32H5_NUART > 1
#  define STM32_UART5_CR1        (STM32_UART5_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART5_CR2        (STM32_UART5_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART5_CR3        (STM32_UART5_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART5_BRR        (STM32_UART5_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART5_GTPR       (STM32_UART5_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART5_RTOR       (STM32_UART5_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART5_RQR        (STM32_UART5_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART5_GTPR       (STM32_UART5_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART5_ISR        (STM32_UART5_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART5_ICR        (STM32_UART5_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART5_RDR        (STM32_UART5_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART5_TDR        (STM32_UART5_BASE + STM32_USART_TDR_OFFSET)
#endif

#if STM32H5_NUART > 2
#  define STM32_UART7_CR1        (STM32_UART7_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART7_CR2        (STM32_UART7_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART7_CR3        (STM32_UART7_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART7_BRR        (STM32_UART7_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART7_GTPR       (STM32_UART7_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART7_RTOR       (STM32_UART7_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART7_RQR        (STM32_UART7_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART7_GTPR       (STM32_UART7_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART7_ISR        (STM32_UART7_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART7_ICR        (STM32_UART7_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART7_RDR        (STM32_UART7_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART7_TDR        (STM32_UART7_BASE + STM32_USART_TDR_OFFSET)
#endif

#if STM32H5_NUART > 3
#  define STM32_UART8_CR1        (STM32_UART8_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART8_CR2        (STM32_UART8_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART8_CR3        (STM32_UART8_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART8_BRR        (STM32_UART8_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART8_GTPR       (STM32_UART8_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART8_RTOR       (STM32_UART8_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART8_RQR        (STM32_UART8_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART8_GTPR       (STM32_UART8_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART8_ISR        (STM32_UART8_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART8_ICR        (STM32_UART8_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART8_RDR        (STM32_UART8_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART8_TDR        (STM32_UART8_BASE + STM32_USART_TDR_OFFSET)
#endif

/* Register Bitfield Definitions ********************************************/

/* Control register 1 */

#define USART_CR1_UE              (1 << 0)  /* Bit 0:  USART enable */
#define USART_CR1_UESM            (1 << 1)  /* Bit 1:  USART enable in low-power mode */
#define USART_CR1_RE              (1 << 2)  /* Bit 2:  Receiver Enable */
#define USART_CR1_TE              (1 << 3)  /* Bit 3:  Transmitter Enable */
#define USART_CR1_IDLEIE          (1 << 4)  /* Bit 4:  IDLE Interrupt Enable */
#define USART_CR1_RXNEIE          (1 << 5)  /* Bit 5:  RXNE Interrupt Enable */
#define USART_CR1_TCIE            (1 << 6)  /* Bit 6:  Transmission Complete Interrupt Enable */
#define USART_CR1_TXEIE           (1 << 7)  /* Bit 7:  TXE Interrupt Enable */
#define USART_CR1_PEIE            (1 << 8)  /* Bit 8:  PE Interrupt Enable */
#define USART_CR1_PS              (1 << 9)  /* Bit 9:  Parity Selection */
#define USART_CR1_PCE             (1 << 10) /* Bit 10: Parity Control Enable */
#define USART_CR1_WAKE            (1 << 11) /* Bit 11: Receiver wakeup method */
#define USART_CR1_M0              (1 << 12) /* Bit 12: Word length, bit 0 */
#define USART_CR1_MME             (1 << 13) /* Bit 13: Mute mode enable */
#define USART_CR1_CMIE            (1 << 14) /* Bit 14: Character match interrupt enable */
#define USART_CR1_OVER8           (1 << 15) /* Bit 15: Oversampling mode */
#define USART_CR1_DEDT_SHIFT      (16)      /* Bits 16-20: Driver Enable deassertion time */
#define USART_CR1_DEDT_MASK       (31 << USART_CR1_DEDT_SHIFT)
#  define USART_CR1_DEDT(n)       ((uint32_t)(n) << USART_CR1_DEDT_SHIFT)
#define USART_CR1_DEAT_SHIFT      (21)      /* Bits 21-25: Driver Enable assertion time */
#define USART_CR1_DEAT_MASK       (31 << USART_CR1_DEAT_SHIFT)
#  define USART_CR1_DEAT(n)       ((uint32_t)(n) << USART_CR1_DEAT_SHIFT)
#define USART_CR1_RTOIE           (1 << 26) /* Bit 26: Receiver timeout interrupt enable */
#define USART_CR1_EOBIE           (1 << 27) /* Bit 27: End of Block interrupt enable */
#define USART_CR1_M1              (1 << 28) /* Bit 28: Word length, bit 1 */
#define USART_CR1_FIFOEN          (1 << 29) /* Bit 29: FIFO mode enable */
#define USART_CR1_TXFEIE          (1 << 30) /* Bit 30: TXFIFO empty interrupt enable */
#define USART_CR1_RXFFIE          (1 << 31) /* Bit 31: RXFIFO Full interrupt enable */

#define USART_CR1_ALLINTS \
  (USART_CR1_IDLEIE | USART_CR1_RXNEIE | USART_CR1_TCIE | USART_CR1_TXEIE |\
   USART_CR1_PEIE | USART_CR1_CMIE |USART_CR1_RTOIE | USART_CR1_EOBIE |\
   USART_CR1_TXFEIE | USART_CR1_RXFFIE)

